<?php
///strpos — Возвращает позицию первого вхождения подстроки
/*$str = 'Hello world!';
echo strpos($str, 'o', 5);///третий параметр с какого символа искать он опционален
*/
///+==  false в цикле. если берем 0 элемент

///strtoupper  переводит в верхний регистр |strtolower  в нижний

/* mb_substr — Возвращает часть строки
$str = 'Привет мир!';
echo mb_substr($str,1);
*/

///htmlspecialchars — Преобразовывает специальные символы в HTML-сущности
$str = '<i>Привет</i>! меня зоут <b>беля</b>!';
echo $str;











